import pandas as pd

# Создание таблицы SCP-кодов
scp_codes = {
    "Патологія": [
        "Фібриляція передсердь", "Пароксизмальна надшлуночкова тахікардія",
        "Блокада AV-вузла першого ступеня", "Повна блокада правої ніжки пучка Гіса",
        "Повна блокада лівої ніжки пучка Гіса", "Неповна блокада правої ніжки пучка Гіса",
        "Блокада лівої передньої гілки", "Блокада лівої задньої гілки", "Синдром Вольфа-Паркінсона-Уайта",
        "Подовжений PR інтервал", "Гіпертрофія лівого шлуночка", "Гіпертрофія правого шлуночка",
        "Вольтажні критерії гіпертрофії лівого шлуночка", "Перевантаження/збільшення лівого передсердя",
        "Перевантаження/збільшення правого передсердя", "Неспецифічна ішемія",
        "Ішемія в антеролатеральних відведеннях", "Ішемія в нижніх відведеннях",
        "Ішемія в інферолатеральних відведеннях", "Ішемія в антеросептальних відведеннях",
        "Нижній інфаркт міокарда", "Антеросептальний інфаркт міокарда", "Передній інфаркт міокарда",
        "Антеролатеральний інфаркт міокарда", "Інферолатеральний інфаркт міокарда",
        "Латеральний інфаркт міокарда", "Подовження QT-інтервалу", "Пізні потенціали передсердь",
        "Пізні потенціали шлуночків"
    ],
    "SCP Код": [
        "AFIB", "PSVT", "1AVB", "CRBBB", "CLBBB", "IRBBB", "LAFB", "LPFB", "WPW", "PRL", "LVH", "RVH",
        "VCLVH", "LAO/LAE", "RAO/RAE", "ISC_", "ISCAL", "ISCIN", "ISCIL", "ISCAS", "ILMI", "IPLMI",
        "ASMI", "ALMI", "IMI", "LMI", "LNGQT", "LA_POT", "LV_POT"
    ]
}

# Создание DataFrame
scp_df = pd.DataFrame(scp_codes)

scp_df.to_csv()